================================================================================
Labels: basic usage
================================================================================

Global:
GlobalExport::
.loop:
Global.local:
: nop

---

(source_file
  (global_label_block
    (label))
  (global_label_block
    (label)
    (local_label_block
      (local))
    (local_label_block
      (local)
      (anonymous_label)
      (instruction_list
        (instruction
          (instruction_name))))))

================================================================================
Labels: Lonely
================================================================================

; lonely labels
.bare
.ok: ; no instruction + inline comment
.done ; no colon + inline comment
:
: ; anonymous label + inline comment

---

(source_file
  (inline_comment)
  (local_label_block
    (local))
  (local_label_block
    (local)
    (inline_comment))
  (local_label_block
    (local)
    (inline_comment)
    (anonymous_label)
    (anonymous_label)
    (inline_comment)))

================================================================================
Labels: global, local, anonymous
================================================================================

;; Global labels
Start:
MainLoop::

; Local labels (shorthand + explicit)
Init:
.loop:
    jr .loop
.mid nop

AnotherGlobal:
AnotherGlobal.local:

; Anonymous labels
    jr :+
:   nop
    jr :-
:   ret

---

(source_file
  (inline_comment)
  (global_label_block
    (label))
  (global_label_block
    (label)
    (inline_comment))
  (global_label_block
    (label)
    (local_label_block
      (local)
      (instruction_list
        (instruction
          (instruction_name)
          (operand_list
            (expression
              (local))))))
    (local_label_block
      (local)
      (instruction_list
        (instruction
          (instruction_name)))))
  (global_label_block
    (label)
    (local_label_block
      (local)
      (inline_comment)
      (instruction_list
        (instruction
          (instruction_name)
          (operand_list
            (expression
              (anonymous_label_ref)))))
      (anonymous_label)
      (instruction_list
        (instruction
          (instruction_name)))
      (instruction_list
        (instruction
          (instruction_name)
          (operand_list
            (expression
              (anonymous_label_ref)))))
      (anonymous_label)
      (instruction_list
        (instruction
          (instruction_name))))))

================================================================================
Labels: whitespace sensitivity (no space vs space before colon)
================================================================================

; No space before colon = label definition
Start:
    nop

Loop::
    ret

; Anonymous label on same line as previous instruction
:   nop
    ld a, 5

; Multiple instructions on same line with ::
    nop :: ret

---

(source_file
  (inline_comment)
  (global_label_block
    name: (label)
    (instruction_list
      (instruction
        opcode: (instruction_name))))
  (global_label_block
    name: (label)
    (instruction_list
      (instruction
        opcode: (instruction_name)))
    (inline_comment)
    (anonymous_label)
    (instruction_list
      (instruction
        opcode: (instruction_name)))
    (instruction_list
      (instruction
        opcode: (instruction_name)
        (operand_list
          (expression
            (register))
          (expression
            (number_literal)))))
    (inline_comment)
    (instruction_list
      (instruction
        opcode: (instruction_name))
      (instruction
        opcode: (instruction_name)))))

================================================================================
Labels: raw identifiers with # prefix
================================================================================

; Raw identifiers allow using reserved keywords as symbols
#load:
#LOAD::
#IF:
#ELSE:

; Can be used in expressions
DEF x = #load + #LOAD

---

(source_file
  (inline_comment)
  (global_label_block
    (raw_identifier))
  (global_label_block
    (raw_identifier))
  (global_label_block
    (raw_identifier))
  (global_label_block
    (raw_identifier)
    (inline_comment)
    (directive
      (def_directive
        (directive_keyword)
        (symbol)
        (expression
          (binary_expression
            (expression
              (raw_identifier))
            (expression
              (raw_identifier))))))))
