================================================================================
Line continuation: simple case
================================================================================

DB 1, \
   2, 3

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))))))

================================================================================
Line continuation: multiple lines
================================================================================

DB 1, 2, 3, \
   4, 5, 6, \
   7, 8, 9

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))))))

================================================================================
Line continuation: in expression
================================================================================

DEF X = 1 + 2 + \
        3 + 4

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (expression
        (binary_expression
          (expression
            (binary_expression
              (expression
                (binary_expression
                  (expression
                    (number_literal))
                  (expression
                    (number_literal))))
              (expression
                (number_literal))))
          (expression
            (number_literal)))))))

================================================================================
Line continuation: in instruction
================================================================================

    ld a, \
       [hl]

---

(source_file
  (instruction_list
    (instruction
      (instruction_name)
      (operand_list
        (register)
        (address
          (register))))))
