================================================================================
Interpolation: prefix vs suffix
================================================================================

DEF {foo}name = 1
DEF foo{name} = 2

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal)))
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal))))

================================================================================
Interpolation: raw identifier
================================================================================

PRINTLN "{#if}"

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (string_literal
          (identifier))))))

================================================================================
Interpolation: raw identifier in DEF
================================================================================

; Issue 3: raw identifier in DEF
DEF #if = 100

---

(source_file
  (inline_comment)
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal))))

================================================================================
Interpolation: raw identifier with interpolation
================================================================================

DEF #if{suffix} = 200

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal))))

===============================================================================
Interpolation: keyword with interpolation
===============================================================================

DEF IF{num} = 250

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal))))

===============================================================================
Invalid: space between identifier and curly brace
:error
===============================================================================

DEF #section {num} = 300

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (ERROR
        (raw_identifier))
      (interpolatable_identifier
        (interpolation
          (interpolation_content)))
      (expression
        (number_literal)))))

================================================================================
Interpolation: Global label
================================================================================

Main{x}::
{y}Sub:

---

(source_file
  (global_label_block
    (global_symbol
      (identifier)))
  (global_label_block
    (global_symbol
      (identifier))))

================================================================================
Interpolation: Local label
================================================================================

{y}.ok:
x{y}.{x}a{ok}y
.{x}:
.if{x}
{a{q}}:

---

(source_file
  (local_label_block
    (qualified_symbol
      (identifier)))
  (local_label_block
    (qualified_symbol
      (identifier)))
  (local_label_block
    (local_symbol
      (identifier)))
  (local_label_block
    (local_symbol
      (identifier)))
  (global_label_block
    (global_symbol
      (identifier))))
