================================================================================
Interpolation: prefix vs suffix
================================================================================

DEF {foo}name = 1
DEF foo{name} = 2

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (interpolatable_identifier
        (interpolation
          (interpolation_content))
        (identifier_fragment))
      (expression
        (number_literal))))
  (directive
    (def_directive
      (directive_keyword)
      (interpolatable_identifier
        (symbol)
        (interpolation
          (interpolation_content)))
      (expression
        (number_literal)))))

================================================================================
Interpolation: raw identifier
================================================================================

PRINTLN "{#if}"

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (string_literal
            (interpolation
              (interpolation_content))))))))

================================================================================
Interpolation: raw identifier in DEF
================================================================================

; Issue 3: raw identifier in DEF
DEF #if = 100

---

(source_file
  (inline_comment)
  (directive
    (def_directive
      (directive_keyword)
      (raw_identifier)
      (expression
        (number_literal)))))

================================================================================
Interpolation: raw identifier with interpolation
================================================================================

DEF #if{suffix} = 200

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (interpolatable_identifier
        (raw_identifier)
        (interpolation
          (interpolation_content)))
      (expression
        (number_literal)))))

===============================================================================
Invalid: space between identifier and curly brace
===============================================================================

DEF #section {num} = 300

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (ERROR
        (raw_identifier))
      (interpolatable_identifier
        (interpolation
          (interpolation_content)))
      (expression
        (number_literal)))))
