================================================================================
Interpolation: basic symbol interpolation
================================================================================

DEF name = 42
PRINTLN "Value is {name}"

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (expression
        (number_literal))))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (string_literal
            (interpolation
              (interpolation_content))))))))

================================================================================
Interpolation: nested interpolation
================================================================================

DEF topic EQUS "answer"
DEF answer = 42
PRINTLN "The {{topic}} is {answer}"

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (directive_keyword)
      (string_literal)))
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (expression
        (number_literal))))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (string_literal
            (interpolation
              (interpolation_content
                (interpolation
                  (interpolation_content))))
            (interpolation
              (interpolation_content))))))))

================================================================================
Interpolation: format specifier
================================================================================

DEF X = 10
PRINTLN "Hex {X:X} dec {d:X} bin {b:X}"

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (expression
        (number_literal))))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (string_literal
            (interpolation
              (format_spec)
              (interpolation_content))
            (interpolation
              (format_spec)
              (interpolation_content))
            (interpolation
              (format_spec)
              (interpolation_content))))))))

================================================================================
Interpolation in names: DEF/FOR/PURGE
================================================================================

DEF prefix EQUS "ITEM"
DEF {prefix} = 1
FOR {prefix}, 1, 3
  PRINTLN "Loop"
ENDR
PURGE {prefix}

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (directive_keyword)
      (string_literal)))
  (directive
    (def_directive
      (directive_keyword)
      (interpolatable_identifier
        (interpolation
          (interpolation_content)))
      (expression
        (number_literal))))
  (directive
    (for_block
      (directive_keyword)
      (expression
        (interpolatable_identifier
          (interpolation
            (interpolation_content))))
      (expression
        (number_literal))
      (expression
        (number_literal))
      (directive
        (simple_directive
          (directive_keyword)
          (argument_list
            (expression
              (string_literal)))))
      (directive_keyword)))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (interpolatable_identifier
            (interpolation
              (interpolation_content))))))))

================================================================================
Interpolation: raw identifier inside braces
================================================================================

PRINTLN "{#if}"

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (string_literal
            (interpolation
              (interpolation_content))))))))

================================================================================
Interpolation: Nested and concatenated
================================================================================

DEF foo{bar}{d:{x}{y}_} = 0

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (interpolatable_identifier
        (identifier_fragment)
        (interpolation
          (interpolation_content))
        (interpolation
          (format_spec)
          (interpolation_content
            (interpolation
              (interpolation_content)))
          (interpolation_content
            (interpolation
              (interpolation_content)))
          (interpolation_content)))
      (expression
        (number_literal)))))

================================================================================
Invalid: # followed by { outside string
================================================================================

    ld a, #{name}

---

(source_file
  (instruction_list
    (instruction
      opcode: (instruction_name)
      (operand_list
        (expression
          (register))
        (ERROR
          (UNEXPECTED '{'))
        (expression
          (interpolatable_identifier
            (interpolation
              name: (interpolation_content))))))))
