================================================================================
Interpolation: basic symbol interpolation
================================================================================

DEF name = 42
PRINTLN "Value is {name}"

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal)))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (string_literal
          (identifier))))))

================================================================================
Interpolation: nested interpolation
================================================================================

DEF topic EQUS "answer"
DEF answer = 42
PRINTLN "The {{topic}} is {answer}"

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (equs_keyword)
      (string_literal)))
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal)))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (string_literal
          (identifier)
          (identifier))))))

================================================================================
Interpolation: format specifier
================================================================================

PRINTLN "Hex {X:X} dec {d:X} bin {b:X}"

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (string_literal
          (identifier)
          (identifier)
          (identifier))))))

================================================================================
Interpolation in names: DEF/FOR/PURGE
================================================================================

DEF prefix EQUS "ITEM"
DEF {prefix} = 1
FOR {prefix}, 1, 3
  PRINTLN "Loop"
ENDR
PURGE {prefix}

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (equs_keyword)
      (string_literal)))
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal)))
  (directive
    (for_block
      (for_keyword)
      (variable
        (identifier))
      (number_literal)
      (number_literal)
      (directive
        (simple_directive
          (directive_keyword)
          (argument_list
            (string_literal))))
      (endr_keyword)))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (variable
          (identifier))))))

================================================================================
Interpolation: raw identifier inside braces
================================================================================

PRINTLN "{#if}"

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (string_literal
          (identifier))))))

================================================================================
Interpolation: Nested and concatenated
================================================================================

DEF foo{bar}{d:{x}{y}_} = 0

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (number_literal))))

================================================================================
Interpolation: # followed by {
================================================================================

    ld a, #{name}

---

(source_file
  (instruction_list
    (instruction
      (generic_instruction
        mnemonic: (instruction_name)
        (operand_list
          (register)
          (variable
            (identifier)))))))

================================================================================
Interpolation: boundaries
:cst
================================================================================

DEF X EQUS "{V}\@ {W}not{Q}" ++ "a"

---

0:0  - 2:0    source_file
1:0  - 1:35     directive
1:0  - 1:35       def_directive
1:0  - 1:3          keyword: def_keyword `DEF`
1:4  - 1:5          name: variable
1:4  - 1:5            identifier `X`
1:6  - 1:10         assign_type: equs_keyword `EQUS`
1:11 - 1:35         value: binary_expression
1:11 - 1:28           left: string_literal
1:11 - 1:12             "\""
1:12 - 1:15             identifier `{V}`
1:15 - 1:17             wrong_escape `\\@`
1:18 - 1:21             identifier `{W}`
1:24 - 1:27             identifier `{Q}`
1:27 - 1:28             "\""
1:29 - 1:31           "++"
1:32 - 1:35           right: string_literal
1:32 - 1:33             "\""
1:34 - 1:35             "\""
