================================================================================
Line continuation: simple case
================================================================================

DB 1, \
   2, 3

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (number_literal))
        (line_continuation)
        (expression
          (number_literal))
        (expression
          (number_literal))))))

================================================================================
Line continuation: multiple lines
================================================================================

DB 1, 2, 3, \
   4, 5, 6, \
   7, 8, 9

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (line_continuation)
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))
        (line_continuation)
        (expression
          (number_literal))
        (expression
          (number_literal))
        (expression
          (number_literal))))))

================================================================================
Line continuation: in expression
================================================================================

DEF X = 1 + 2 + \
        3 + 4

---

(source_file
  (directive
    (def_directive
      (directive_keyword)
      (symbol)
      (expression
        (binary_expression
          (expression
            (binary_expression
              (expression
                (binary_expression
                  (expression
                    (number_literal))
                  (expression
                    (number_literal))))
              (line_continuation)
              (expression
                (number_literal))))
          (expression
            (number_literal)))))))

================================================================================
Line continuation: in instruction
================================================================================

    ld a, \
       [hl]

---

(source_file
  (instruction_list
    (instruction
      (instruction_name)
      (operand_list
        (expression
          (register))
        (line_continuation)
        (address
          (expression
            (register)))))))

================================================================================
Line continuation: with comment
================================================================================

    foo 1 \  ; this is a comment
       2
    println strfmt("" \; no space
       )
    macro_call arg1, arg2, \; comment must not become raw arg!
       arg3

---

(source_file
  (directive
    (macro_invocation
      (symbol)
      (argument_list
        (macro_arg_raw)
        (line_continuation
          (inline_comment))
        (macro_arg_raw))))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (expression
          (function_call
            (function_name)
            (expression
              (string_literal))
            (line_continuation
              (inline_comment)))))))
  (directive
    (macro_invocation
      (symbol)
      (argument_list
        (expression
          (symbol))
        (expression
          (symbol))
        (line_continuation
          (inline_comment))
        (expression
          (symbol))))))
