================================================================================
Line continuation: simple case
================================================================================

DB 1, \
   2, 3

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (number_literal)
        (line_continuation)
        (number_literal)
        (number_literal)))))

================================================================================
Line continuation: multiple lines
================================================================================

DB 1, 2, 3, \
   4, 5, 6, \
   7, 8, 9

---

(source_file
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (number_literal)
        (number_literal)
        (number_literal)
        (line_continuation)
        (number_literal)
        (number_literal)
        (number_literal)
        (line_continuation)
        (number_literal)
        (number_literal)
        (number_literal)))))

================================================================================
Line continuation: in expression
================================================================================

DEF X = 1 + 2 + \
        3 + 4

---

(source_file
  (directive
    (def_directive
      (def_keyword)
      (variable
        (identifier))
      (binary_expression
        (binary_expression
          (binary_expression
            (number_literal)
            (number_literal))
          (line_continuation)
          (number_literal))
        (number_literal)))))

================================================================================
Line continuation: in instruction
================================================================================

    ld a, \
       [hl]

---

(source_file
  (instruction_list
    (instruction
      (instruction_name)
      (operand_list
        (register)
        (line_continuation)
        (address
          (register))))))

================================================================================
Line continuation: with comment
================================================================================

    foo 1 \  ; this is a comment
       2
    println strfmt("" \; no space
       )
    macro_call arg1, arg2, \; comment must not become raw arg!
       arg3

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (number_literal)
        (line_continuation
          (inline_comment))
        (number_literal))))
  (directive
    (simple_directive
      (directive_keyword)
      (argument_list
        (function_call
          (function_name)
          (string_literal)
          (line_continuation
            (inline_comment))))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))
        (line_continuation
          (inline_comment))
        (variable
          (identifier))))))
