================================================================================
Macros: no arguments
================================================================================

foo_macro
bar_macro
spam_macro ;

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))))
  (directive
    (macro_invocation
      (variable
        (identifier))))
  (directive
    (macro_invocation
      (variable
        (identifier))))
  (inline_comment))

================================================================================
Macros: expression arguments with numbers
================================================================================

parens (0)
mymacro 1, 2, 3
calcmacro (FOO + 1) << 2

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (paren
          (number_literal)))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (number_literal)
        (number_literal)
        (number_literal))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (binary_expression
          left: (paren
            (binary_expression
              left: (variable
                (identifier))
              right: (number_literal)))
          right: (number_literal))))))

================================================================================
Macros: expression arguments with strings
================================================================================

print_str "Hello"
print_pair "foo", "bar"

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (string_literal))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (string_literal)
        (string_literal)))))

================================================================================
Macros: simple RAW arguments
================================================================================

print_all This test probably passes
debug_macro some words here

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier)))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))))))

================================================================================
Macros: RAW arguments with multiple words
================================================================================

print_all This test has multiple words
log_macro Processing file data now

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier)))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))))))

================================================================================
Macros: comment only (no RAW mode)
================================================================================

somemacro ; just a comment, no args
testmacro ; another comment

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))))
  (inline_comment)
  (directive
    (macro_invocation
      (variable
        (identifier))))
  (inline_comment))

================================================================================
Macros: block comment then RAW text
================================================================================

print_all /* leading comment */ This is RAW text
debug_log /* note */ Processing data

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (block_comment)
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier))
        (variable
          (identifier)))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (block_comment)
      (argument_list
        (variable
          (identifier))
        (variable
          (identifier))))))

================================================================================
Macros: expression arguments with identifiers
================================================================================

; Single identifiers correctly use expression parsing with improved heuristics

mymacro single_identifier
simple_call A

---

(source_file
  (inline_comment)
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (variable
          (identifier)))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (register)))))

================================================================================
Macros: mixed string and number arguments
================================================================================

log_entry "Error", 42
format_msg "Hello", 123, "World"

---

(source_file
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (string_literal)
        (number_literal))))
  (directive
    (macro_invocation
      (variable
        (identifier))
      (argument_list
        (string_literal)
        (number_literal)
        (string_literal)))))

================================================================================
Macros: macro num arg in identifiers
================================================================================

\1_a:
\<-1>:
\<2>\@:

---

(source_file
  (global_label_block
    (global_symbol
      (identifier)))
  (global_label_block
    (global_symbol
      (identifier)))
  (global_label_block
    (global_symbol
      (identifier))))

================================================================================
Macros: macro identifier arg in identifiers
================================================================================

\<name>:
\<name\@>:

---

(source_file
  (global_label_block
    (global_symbol
      (identifier)))
  (global_label_block
    (global_symbol
      (identifier))))

================================================================================
Macros: macro nested arg in identifiers
================================================================================

\<#foo\<1>>:
\<#bar\<name\@>>:

---

(source_file
  (global_label_block
    (global_symbol
      (identifier)))
  (global_label_block
    (global_symbol
      (identifier))))
