================================================================================
Format string: x
================================================================================
{x:x}
---

(input
  (global
    (variable_interpolation
      (format_string)
      (global))))

================================================================================
Format string: X
================================================================================
{X:x}
---

(input
  (global
    (variable_interpolation
      (format_string)
      (global))))

================================================================================
Format string: exact s padded
================================================================================
{#10s:{x}}
---

(input
  (global
    (variable_interpolation
      (format_string)
      (global
        (variable_interpolation
          (global))))))

================================================================================
Format string: plus
================================================================================
{+d:{x}}
---

(input
  (global
    (variable_interpolation
      (format_string)
      (global
        (variable_interpolation
          (global))))))
